Tekla Open API Reference for Tekla Structures 2025
AutoDirectionTypeAttribute Properties
The AutoDirectionTypeAttribute type exposes the following members.
Properties
Name | Description
Type
 The custom attribute [AutoDirectionType()] uses this to store the auto direction type to the system. This is not to be used by itself.
Top
See Also
Reference
AutoDirectionTypeAttribute Class
Tekla.Structures.Plugins Namespace